# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [12]:
from numpy.random import randn
np.random.seed(101)

In [13]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [15]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [17]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [18]:
type(df['W'])

pandas.core.series.Series

### Creating a new column:

In [19]:
df['new'] = df['W'] + df['Y']

In [20]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

### Removing Columns

In [21]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [22]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [23]:
df.drop('new',axis=1,inplace=True)

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Can also drop rows this way:

In [25]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

### Selecting Rows

In [26]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Or select based off of position instead of label

In [27]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

### Selecting subset of rows and columns

In [28]:
df.loc['B','Y']

-0.8480769834036315

In [29]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [30]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [32]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df[df['W']>0]['Y']

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [36]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [37]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [39]:
newind = 'CA NY WY OR CO'.split()

In [40]:
df['States'] = newind

In [41]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [43]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [44]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [45]:
df.set_index('States',inplace=True)

In [46]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## DataFrame Summaries
There are a couple of ways to obtain summary data on DataFrames.<br>
<tt><strong>df.describe()</strong></tt> provides summary statistics on all numerical columns.<br>
<tt><strong>df.info and df.dtypes</strong></tt> displays the data type of all columns.

In [47]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [48]:
df.dtypes

W    float64
X    float64
Y    float64
Z    float64
dtype: object

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, CA to CO
Data columns (total 4 columns):
W    5 non-null float64
X    5 non-null float64
Y    5 non-null float64
Z    5 non-null float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [50]:
df = pd.DataFrame(randn(5,4))
df

          0         1         2         3
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [53]:
mylist = [1,2]
df[mylist]

          1         2
0  1.693723 -1.706086
1  0.390528  0.166905
2  0.072960  0.638787
3 -0.754070 -0.943406
4  1.901755  0.238127

In [55]:
df['new'] = df[1] + df[2]
df

          0         1         2         3       new
0  0.302665  1.693723 -1.706086 -1.159119 -0.012363
1 -0.134841  0.390528  0.166905  0.184502  0.557432
2  0.807706  0.072960  0.638787  0.329646  0.711747
3 -0.497104 -0.754070 -0.943406  0.484752 -1.697476
4 -0.116773  1.901755  0.238127  1.996652  2.139882

In [56]:
df.drop(0,axis=1)

          1         2         3       new
0  1.693723 -1.706086 -1.159119 -0.012363
1  0.390528  0.166905  0.184502  0.557432
2  0.072960  0.638787  0.329646  0.711747
3 -0.754070 -0.943406  0.484752 -1.697476
4  1.901755  0.238127  1.996652  2.139882

In [57]:
df.drop(3,axis=0)

          0         1         2         3       new
0  0.302665  1.693723 -1.706086 -1.159119 -0.012363
1 -0.134841  0.390528  0.166905  0.184502  0.557432
2  0.807706  0.072960  0.638787  0.329646  0.711747
4 -0.116773  1.901755  0.238127  1.996652  2.139882

In [58]:
df.loc[3]

0     -0.497104
1     -0.754070
2     -0.943406
3      0.484752
new   -1.697476
Name: 3, dtype: float64

In [62]:
df.iloc[[0,3]]

          0         1         2         3       new
0  0.302665  1.693723 -1.706086 -1.159119 -0.012363
3 -0.497104 -0.754070 -0.943406  0.484752 -1.697476

In [63]:
df.loc[[0,3],[3,'new']]

          3       new
0 -1.159119 -0.012363
3  0.484752 -1.697476

In [64]:
df >0

       0      1      2      3    new
0   True   True  False  False  False
1  False   True   True   True   True
2   True   True   True   True   True
3  False  False  False   True  False
4  False   True   True   True   True

In [65]:
df[df>0]

          0         1         2         3       new
0  0.302665  1.693723       NaN       NaN       NaN
1       NaN  0.390528  0.166905  0.184502  0.557432
2  0.807706  0.072960  0.638787  0.329646  0.711747
3       NaN       NaN       NaN  0.484752       NaN
4       NaN  1.901755  0.238127  1.996652  2.139882

In [66]:
df[df['new'] >0]

          0         1         2         3       new
1 -0.134841  0.390528  0.166905  0.184502  0.557432
2  0.807706  0.072960  0.638787  0.329646  0.711747
4 -0.116773  1.901755  0.238127  1.996652  2.139882

In [69]:
df[(df['new'] > 0) & (df[3] >0.2)]

          0         1         2         3       new
2  0.807706  0.072960  0.638787  0.329646  0.711747
4 -0.116773  1.901755  0.238127  1.996652  2.139882

In [71]:
df[(df['new'] > 0) | (df[3] >0.2)]

          0         1         2         3       new
1 -0.134841  0.390528  0.166905  0.184502  0.557432
2  0.807706  0.072960  0.638787  0.329646  0.711747
3 -0.497104 -0.754070 -0.943406  0.484752 -1.697476
4 -0.116773  1.901755  0.238127  1.996652  2.139882

In [79]:
df['states'] = 'aa bb cc dd ff'.split()
df

               0         1         2         3       new states
states
aa      0.302665  1.693723 -1.706086 -1.159119 -0.012363     aa
bb     -0.134841  0.390528  0.166905  0.184502  0.557432     bb
cc      0.807706  0.072960  0.638787  0.329646  0.711747     cc
dd     -0.497104 -0.754070 -0.943406  0.484752 -1.697476     dd
ff     -0.116773  1.901755  0.238127  1.996652  2.139882     ff

In [80]:
df.set_index('states',inplace=True)
df

               0         1         2         3       new
states
aa      0.302665  1.693723 -1.706086 -1.159119 -0.012363
bb     -0.134841  0.390528  0.166905  0.184502  0.557432
cc      0.807706  0.072960  0.638787  0.329646  0.711747
dd     -0.497104 -0.754070 -0.943406  0.484752 -1.697476
ff     -0.116773  1.901755  0.238127  1.996652  2.139882